### 1.Import the dataset and explore basic info (nulls, data types).

In [9]:
import pandas as pd

In [14]:
# Load the Titanic dataset
data= pd.read_csv(r"C:\Users\baps\Downloads\titanicdata\Titanic-Dataset.csv")

In [15]:
data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
 # total columns 
data.columns.tolist(),

(['PassengerId',
  'Survived',
  'Pclass',
  'Name',
  'Sex',
  'Age',
  'SibSp',
  'Parch',
  'Ticket',
  'Fare',
  'Cabin',
  'Embarked'],)

In [20]:
# type of  data
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [22]:
# informations of data 
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### 2.Handle missing values using mean/median/imputation.

In [23]:
# 1. Fill missing 'Age' with median (less sensitive to outliers)
data['Age'].fillna(data['Age'].median(), inplace=True)

C:\Users\baps\AppData\Local\Temp\ipykernel_21984\2603622875.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Age'].fillna(data['Age'].median(), inplace=True)

In [24]:

# 2. Fill missing 'Embarked' with mode (most frequent value)
data['Embarked'].fillna(data['Embarked'].mode()[0], inplace=True)

C:\Users\baps\AppData\Local\Temp\ipykernel_21984\3074554371.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Embarked'].fillna(data['Embarked'].mode()[0], inplace=True)

In [26]:
# 3. Drop 'Cabin' due to too many missing values
data.drop(columns=['Cabin'], inplace=True)

In [27]:
# Verify changes
missing_after_cleaning = data.isnull().sum()
missing_after_cleaning

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

### 3.Convert categorical features into numerical using encoding.

In [28]:
from sklearn.preprocessing import LabelEncoder

# Encode 'Sex' and 'Embarked' using Label Encoding
label_enc = LabelEncoder()
data['Sex'] = label_enc.fit_transform(data['Sex'])        # male=1, female=0
data['Embarked'] = label_enc.fit_transform(data['Embarked'])  # S=2, C=0, Q=1

# Display encoded values for reference
encoded_samples = data[['Sex', 'Embarked']].head()

encoded_samples

   Sex  Embarked
0    1         2
1    0         0
2    0         2
3    0         2
4    1         2

### 4.Normalize/standardize the numerical features.

In [29]:
from sklearn.preprocessing import StandardScaler

# Selecting numeric columns to scale
numeric_cols = ['Age', 'Fare', 'SibSp', 'Parch']
scaler = StandardScaler()
df_scaled = data.copy()
df_scaled[numeric_cols] = scaler.fit_transform(df_scaled[numeric_cols])

# Show first few rows of scaled data
df_scaled[numeric_cols].head()

        Age      Fare     SibSp     Parch
0 -0.565736 -0.502445  0.432793 -0.473674
1  0.663861  0.786845  0.432793 -0.473674
2 -0.258337 -0.488854 -0.474545 -0.473674
3  0.433312  0.420730  0.432793 -0.473674
4  0.433312 -0.486337 -0.474545 -0.473674